Revit 2027 API
EnergyAnalysisOpening.GetConstruction Method
 Gets the analytic construction this opening is associated with. Null when this opening is a window.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EnergyAnalysisConstruction GetConstruction()
Public Function GetConstruction As EnergyAnalysisConstruction
public:
EnergyAnalysisConstruction^ GetConstruction()
member GetConstruction : unit -> EnergyAnalysisConstruction
Return Value
EnergyAnalysisConstruction
 The analytic construction.
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace